{"translation-revision-date": "2026-02-21 12:00+0000", "generator": "WP-CLI/2.12.0", "source": "plugins/mapthread/build/blocks/map-gpx/index.js", "domain": "messages", "locale_data": {"messages": {"": {"domain": "messages", "lang": "es_ES", "plural-forms": "nplurals=2; plural=(n != 1);"}, "Street Map": ["Mapa de calles"], "Invalid GPX format - XML parsing failed": ["Formato GPX no válido - error en el análisis XML"], "No track or route points found in GPX file": ["No se encontraron puntos de ruta o track en el archivo GPX"], "Failed to parse GPX file": ["No se pudo analizar el archivo GPX"], "Please select a valid GPX file": ["Por favor, selecciona un archivo GPX válido"], "Warning: File size exceeds 10MB. This may cause performance issues.": ["Advertencia: El tamaño del archivo supera los 10 MB. Esto puede causar problemas de rendimiento."], "Warning: Track has more than 50,000 points. This may cause performance issues.": ["Advertencia: El track tiene más de 50 000 puntos. Esto puede causar problemas de rendimiento."], "Error loading GPX file. Please try again.": ["Error al cargar el archivo GPX. Inténtalo de nuevo."], "Map GPX": ["Mapa GPX"], "Processing GPX file...": ["Procesando archivo GPX..."], "Map Settings": ["Ajustes del mapa"], "Show progress indicator": ["Mostrar indicador de progreso"], "Animate position along track as readers scroll": ["Animar la posición a lo largo del track mientras los lectores se desplazan"], "Allow GPX download": ["Permitir descarga GPX"], "Show a download button so visitors can save the GPX file": ["Mostrar un botón de descarga para que los visitantes puedan guardar el archivo GPX"], "Upload a GPX file to display your route or track on an interactive map.": ["Sube un archivo GPX para mostrar tu ruta o track en un mapa interactivo."], "Upload GPX File": ["Subir archivo GPX"], "Show elevation profile": ["Mostrar perfil de elevación"], "Display elevation chart at bottom of map": ["Mostrar gráfico de elevación en la parte inferior del mapa"], "Default Map Style": ["Estilo de mapa predeterminado"], "Choose which map style displays when the page loads": ["Elige qué estilo de mapa se muestra cuando se carga la página"], "Configure map providers": ["Configurar proveedores de mapas"], "Multiple Map GPX blocks detected. Only the first block will be used on the frontend.": ["Se detectaron varios bloques de Mapa GPX. Solo se usará el primer bloque en el frontend."], "GPX uploaded:": ["GPX cargado:"], "track points": ["puntos de track"], "Bounds:": ["Límites:"], "Replace GPX": ["Reemplazar GPX"], "Remove GPX": ["Eliminar GPX"]}}}